import styled from "@emotion/styled";
import { fonts } from "../styles/fonts";
import colors from "../styles/colors";

const Container = styled.div`
  width: 394px;
  height: auto;
  background-color: #f0f6ff;
`;

const TopContainer = styled.div`
  width: 394px;
  height: 47px;
  position: relative;
  background-color: #fff;
  display: flex;
  align-items: center;
  justify-content: center;
`;

const SignWrap = styled.div`
  width: 18px;
  height: 18px;
  left: 10px;
  top: 35%;
  position: absolute;
  overflow: hidden;
  display: flex;
  align-items: center;
  justify-content: center;
`;

const Image = styled.img`
  width: 100%;
  height: auto;
`;

const SignDiv = styled.div`
  height: 100%;
  font-family: ${fonts.bold};
  font-size: 16px;
  display: flex;
  justify-content: center;
  align-items: center;
`;

const ProfileWrap = styled.div`
  padding: 13px;
`;

const ProfileMain = styled.div`
  width: 367px;
  height: 144px;
  background: #fff;
  border-radius: 16px;
  display: flex;
  align-items: center;
  padding: 20px;
  gap: 26px;
  margin-bottom: 21px;
  box-shadow: 0px 1px 4px rgba(12, 12, 13, 0.05);
`;
const ProfileImageWrap = styled.div`
  width: 105px;
  height: 105px;
  border-radius: 50%;
`;
const ProfileImage = styled.img`
  width: 100%;
  height: 100%;
`;
const ProfileInfo = styled.div`
  display: flex;
  flex-direction: column;
  gap: 7px;
`;

const ProfileNickName = styled.div`
  font-size: 15px;
  font-family: ${fonts.bold};
  display: flex;
`;

const NickEditImage = styled.img`
  width: 12px;
  height: 12px;
  cursor: pointer;
`;

const ProfileEtc = styled.div`
  font-size: 12px;
  color: #8f8f8f;
  display: flex;
  flex-direction: column;
  gap: 7px;
  cursor: pointer;
`;

const ProfileFeel = styled.div`
  position: relative;
  width: 367px;
  height: 126px;
  background-color: #fff;
  border-radius: 16px;
  align-items: center;
  margin-bottom: 12px;
  padding: 0 12px;
  box-shadow: 0px 1px 4px rgba(12, 12, 13, 0.05);
`;

const ProfileFeelDiv = styled.div`
  height: 100%;
  font-size: 15px;
  display: flex;
  padding: 15px;
  padding-left: 25px;
`;

const ProfileIcon = styled.svg`
  position: absolute;
  height: 25px;
  width: 22px;
  flex-shrink: 0;
  left: 3%;
  top: 10%;
`;

const ProfileFeelAvg = styled.div`
  position: absolute;
  justify-content: center;
  transform: translateY(-150%);
  display: block;
  width: 342px;
  height: 71px;
  padding: 10px;
  align-items: center;
  background: #f0f6ff;
  border-radius: 12px;
  margin-top: 25px;
  font-size: 14px;
`;
const EmotionP = styled.div`
  padding: 10px;
  letter-spacing: 1.5px;
`;

const ButtonWrap = styled.div`
  display: flex;
  flex-direction: column;
  gap: 10px;
`;

const Button = styled.button`
  width: 367px;
  height: 63px;
  border-radius: 16px;
  padding: 10px 10px;
  text-align: center;
  background-color: #fff;
  border: none;
  box-shadow: 0px 1px 4px rgba(12, 12, 13, 0.05);
  display: flex;
  align-items: center;
  gap: 16px;
  font-size: 16px;
  cursor: pointer;
`;

const IconCircleAlert = styled.div`
  width: 40px;
  height: 40px;
  border-radius: 50%;
  background: #bdd7ff;
  display: flex;
  align-items: center;
  justify-content: center;
`;
const AlertImage = styled.img`
  width: 20px;
  height: 20px;
`;

const IconCircleTheme = styled.div`
  width: 40px;
  height: 40px;
  border-radius: 50%;
  background: #fedda2;
  display: flex;
  align-items: center;
  justify-content: center;
`;

const IconCirclePersonalInfo = styled.div`
  width: 40px;
  height: 40px;
  border-radius: 50%;
  background: #adf4d0;
  display: flex;
  align-items: center;
  justify-content: center;
`;

const IconCircleEtc = styled.div`
  width: 40px;
  height: 40px;
  border-radius: 50%;
  background: #fccede;
  display: flex;
  align-items: center;
  justify-content: center;
`;

const IconCircleInfo = styled.div`
  width: 40px;
  height: 40px;
  border-radius: 50%;
  background: #e3e8ee;
  display: flex;
  align-items: center;
  justify-content: center;
`;

const Logout = styled.div`
  font-size: 13px;
  color: #8f8f8f;
  font-weight: 500;
  padding-top: 14px;
  text-align: right;
  padding-right: 10px;
  text-decoration: underline;
  cursor: pointer;
`;
const NavigationBar = styled.ul`
  display: flex;
  width: 100%;
  list-style: none;
  padding: 0;
  margin: 0;
`;

const NavItemFocus = styled.li`
  display: flex;
  flex-direction: column;
  justify-content: center;
  align-items: center;
  padding: 14px 0;
  width: 25%;
  cursor: pointer;
  background-color: #bdd7ff;
  color: #579aff;
`;
const NavItem = styled.li`
  display: flex;
  flex-direction: column;
  justify-content: center;
  align-items: center;
  padding: 14px 0;
  width: 25%;
  background-color: #fff;
  color: #a8a8a8;
  cursor: pointer;
`;
const AlertPopUp = styled.div`
  display: flex;
  position: fixed;
  z-index: 99999;
  width: 394px;
  height: 100%;
  justify-content: center;
  align-items: center;
  background-color: rgba(0, 0, 0, 0.6);
  display: none;
`;
const AlertPopUpBox = styled.div`
  width: 286px;
  height: 359px;
  background-color: ${colors.white};
  border-radius: 16px;
  padding: 40px;
`;

function Profile() {
  return (
    <Container>
      <AlertPopUp>
        <AlertPopUpBox>
          <div>
            <div>
              <span>알림설정</span>
              <button>토글버튼</button>
            </div>
            <div>소리 / 진동 / 무음</div>
          </div>
          <div>요일</div>
          <div>확인/취소</div>
        </AlertPopUpBox>
      </AlertPopUp>
      <TopContainer>
        <SignWrap>
          <div>
            <Image src="./images/majesticons_arrow-left.svg" alt="뒤로가기" />
          </div>
        </SignWrap>
        <SignDiv>프로필</SignDiv>
      </TopContainer>
      <ProfileWrap>
        <ProfileMain>
          <ProfileImageWrap>
            <ProfileImage src="./images/pansky.png" alt="프로필 이미지" />
          </ProfileImageWrap>
          <ProfileInfo>
            <ProfileNickName>
              닉네임
              <div>
                <NickEditImage src="./images/arrowedit.svg" alt="닉네임수정" />
              </div>
            </ProfileNickName>
            <ProfileEtc>
              <div>상태</div>
              <div>이메일</div>
            </ProfileEtc>
          </ProfileInfo>
        </ProfileMain>
        <ProfileFeel>
          <ProfileFeelDiv>
            <ProfileIcon
              xmlns="http://www.w3.org/2000/svg"
              width="33"
              height="30"
              viewBox="0 0 33 30"
              fill="none"
            >
              <g filter="url(#filter0_d_168_5479)">
                <path
                  d="M22.37 3C19.815 3 17.6088 4.463 16.5 6.597C15.3912 4.463 13.185 3 10.63 3C6.9675 3 4 6.003 4 9.699C4 13.395 6.27125 16.783 9.20625 19.566C12.1413 22.349 16.5 25 16.5 25C16.5 25 20.7175 22.393 23.7937 19.566C27.075 16.552 29 13.406 29 9.699C29 5.992 26.0325 3 22.37 3Z"
                  fill="#BDD7FF"
                />
              </g>
              <defs>
                <filter
                  id="filter0_d_168_5479"
                  x="0"
                  y="0"
                  width="33"
                  height="30"
                  filterUnits="userSpaceOnUse"
                  colorInterpolationFilters="sRGB"
                >
                  <feFlood floodOpacity="0" result="BackgroundImageFix" />
                  <feColorMatrix
                    in="SourceAlpha"
                    type="matrix"
                    values="0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 127 0"
                    result="hardAlpha"
                  />
                  <feOffset dy="1" />
                  <feGaussianBlur stdDeviation="2" />
                  <feComposite in2="hardAlpha" operator="out" />
                  <feColorMatrix
                    type="matrix"
                    values="0 0 0 0 0.0470588 0 0 0 0 0.0470588 0 0 0 0 0.0509804 0 0 0 0.05 0"
                  />
                  <feBlend
                    mode="normal"
                    in2="BackgroundImageFix"
                    result="effect1_dropShadow_168_5479"
                  />
                  <feBlend
                    mode="normal"
                    in="SourceGraphic"
                    in2="effect1_dropShadow_168_5479"
                    result="shape"
                  />
                </filter>
              </defs>
            </ProfileIcon>
            나의 감정 성향
          </ProfileFeelDiv>
          <ProfileFeelAvg>
            <EmotionP>
              평균적으로 불안하고 지친 감정이 많아요. 에너지 소비가 많아
              지치시는 편이에요.
            </EmotionP>
          </ProfileFeelAvg>
        </ProfileFeel>
        <ButtonWrap>
          <Button>
            <IconCircleAlert>
              <AlertImage src="./images/alert.svg" alt="알림" />
            </IconCircleAlert>
            알림
          </Button>
          <Button>
            <IconCircleTheme>
              <svg
                xmlns="http://www.w3.org/2000/svg"
                width="20"
                height="20"
                viewBox="0 0 20 20"
                fill="none"
              >
                <path
                  d="M9.99999 14.7915C9.05229 14.7915 8.12587 14.5105 7.33788 13.984C6.5499 13.4574 5.93574 12.7091 5.57307 11.8335C5.2104 10.958 5.11551 9.99452 5.30039 9.06503C5.48528 8.13554 5.94164 7.28174 6.61177 6.61162C7.2819 5.94149 8.13569 5.48513 9.06518 5.30024C9.99467 5.11535 10.9581 5.21024 11.8337 5.57291C12.7092 5.93558 13.4576 6.54974 13.9841 7.33773C14.5106 8.12572 14.7917 9.05213 14.7917 9.99984C14.7895 11.27 14.2839 12.4875 13.3858 13.3856C12.4876 14.2838 11.2701 14.7893 9.99999 14.7915ZM9.99999 6.45817C9.29951 6.45817 8.61477 6.66589 8.03234 7.05505C7.44992 7.44421 6.99598 7.99734 6.72792 8.6445C6.45986 9.29165 6.38972 10.0038 6.52638 10.6908C6.66303 11.3778 7.00034 12.0089 7.49565 12.5042C7.99096 12.9995 8.62203 13.3368 9.30904 13.4735C9.99606 13.6101 10.7082 13.54 11.3553 13.2719C12.0025 13.0038 12.5556 12.5499 12.9448 11.9675C13.3339 11.3851 13.5417 10.7003 13.5417 9.99984C13.5395 9.0612 13.1656 8.16165 12.5019 7.49793C11.8382 6.83422 10.9386 6.46037 9.99999 6.45817ZM9.99999 4.1665C9.8349 4.16435 9.67718 4.0978 9.56043 3.98106C9.44369 3.86431 9.37715 3.70659 9.37499 3.5415V2.2915C9.37499 2.12574 9.44084 1.96677 9.55805 1.84956C9.67526 1.73235 9.83423 1.6665 9.99999 1.6665C10.1657 1.6665 10.3247 1.73235 10.4419 1.84956C10.5591 1.96677 10.625 2.12574 10.625 2.2915V3.5415C10.6228 3.70659 10.5563 3.86431 10.4395 3.98106C10.3228 4.0978 10.1651 4.16435 9.99999 4.1665ZM9.99999 18.3332C9.8349 18.331 9.67718 18.2645 9.56043 18.1477C9.44369 18.031 9.37715 17.8733 9.37499 17.7082V16.4582C9.37499 16.2924 9.44084 16.1334 9.55805 16.0162C9.67526 15.899 9.83423 15.8332 9.99999 15.8332C10.1657 15.8332 10.3247 15.899 10.4419 16.0162C10.5591 16.1334 10.625 16.2924 10.625 16.4582V17.7082C10.6228 17.8733 10.5563 18.031 10.4395 18.1477C10.3228 18.2645 10.1651 18.331 9.99999 18.3332ZM17.7083 10.6248H16.4583C16.2926 10.6248 16.1336 10.559 16.0164 10.4418C15.8992 10.3246 15.8333 10.1656 15.8333 9.99984C15.8333 9.83408 15.8992 9.67511 16.0164 9.5579C16.1336 9.44069 16.2926 9.37484 16.4583 9.37484H17.7083C17.8741 9.37484 18.0331 9.44069 18.1503 9.5579C18.2675 9.67511 18.3333 9.83408 18.3333 9.99984C18.3333 10.1656 18.2675 10.3246 18.1503 10.4418C18.0331 10.559 17.8741 10.6248 17.7083 10.6248ZM3.54166 10.6248H2.29166C2.1259 10.6248 1.96692 10.559 1.84971 10.4418C1.7325 10.3246 1.66666 10.1656 1.66666 9.99984C1.66666 9.83408 1.7325 9.67511 1.84971 9.5579C1.96692 9.44069 2.1259 9.37484 2.29166 9.37484H3.54166C3.70742 9.37484 3.86639 9.44069 3.9836 9.5579C4.10081 9.67511 4.16666 9.83408 4.16666 9.99984C4.16666 10.1656 4.10081 10.3246 3.9836 10.4418C3.86639 10.559 3.70742 10.6248 3.54166 10.6248ZM5.41666 6.0415C5.25587 6.02921 5.1063 5.95442 4.99999 5.83317L4.09166 4.99984C4.03201 4.9402 3.9847 4.86939 3.95243 4.79146C3.92015 4.71354 3.90353 4.63002 3.90353 4.54567C3.90353 4.46132 3.92015 4.3778 3.95243 4.29988C3.9847 4.22195 4.03201 4.15115 4.09166 4.0915C4.1513 4.03186 4.2221 3.98455 4.30003 3.95227C4.37796 3.92 4.46148 3.90338 4.54582 3.90338C4.63017 3.90338 4.71369 3.92 4.79162 3.95227C4.86954 3.98455 4.94035 4.03186 4.99999 4.0915L5.83332 4.99984C5.93581 5.11443 5.99248 5.26277 5.99248 5.4165C5.99248 5.57024 5.93581 5.71858 5.83332 5.83317C5.72702 5.95442 5.57744 6.02921 5.41666 6.0415ZM15.4667 16.0915C15.3845 16.0919 15.3032 16.0759 15.2273 16.0444C15.1515 16.0129 15.0827 15.9666 15.025 15.9082L14.1667 14.9998C14.111 14.8832 14.0928 14.7522 14.1146 14.6248C14.1365 14.4974 14.1973 14.3799 14.2887 14.2885C14.3801 14.1972 14.4976 14.1363 14.6249 14.1145C14.7523 14.0926 14.8834 14.1108 15 14.1665L15.9083 14.9998C16.0254 15.117 16.0911 15.2759 16.0911 15.4415C16.0911 15.6071 16.0254 15.766 15.9083 15.8832C15.8528 15.9461 15.7849 15.9971 15.709 16.0329C15.633 16.0687 15.5506 16.0887 15.4667 16.0915ZM14.5833 6.0415C14.4225 6.02921 14.273 5.95442 14.1667 5.83317C14.0642 5.71858 14.0075 5.57024 14.0075 5.4165C14.0075 5.26277 14.0642 5.11443 14.1667 4.99984L15 4.0915C15.1204 3.97105 15.2838 3.90338 15.4542 3.90338C15.6245 3.90338 15.7879 3.97105 15.9083 4.0915C16.0288 4.21196 16.0964 4.37532 16.0964 4.54567C16.0964 4.71602 16.0288 4.87938 15.9083 4.99984L15 5.83317C14.8937 5.95442 14.7441 6.02921 14.5833 6.0415ZM4.53332 16.0915C4.45121 16.0919 4.36984 16.0759 4.294 16.0444C4.21815 16.0129 4.14936 15.9666 4.09166 15.9082C3.97461 15.791 3.90887 15.6321 3.90887 15.4665C3.90887 15.3009 3.97461 15.142 4.09166 15.0248L4.99999 14.1665C5.11662 14.1108 5.24765 14.0926 5.37503 14.1145C5.50242 14.1363 5.61989 14.1972 5.71128 14.2885C5.80268 14.3799 5.86349 14.4974 5.88534 14.6248C5.9072 14.7522 5.88902 14.8832 5.83332 14.9998L4.99999 15.9082C4.93938 15.9697 4.86652 16.0178 4.78613 16.0494C4.70574 16.081 4.61961 16.0953 4.53332 16.0915Z"
                  fill="#D8A12D"
                />
              </svg>
            </IconCircleTheme>
            테마
          </Button>
          <Button>
            <IconCirclePersonalInfo>
              <svg
                xmlns="http://www.w3.org/2000/svg"
                width="24"
                height="24"
                viewBox="0 0 24 24"
                fill="none"
              >
                <path
                  d="M11 15.0001H13V12.5001H15.5V10.5001H13V8.00015H11V10.5001H8.5V12.5001H11V15.0001ZM12 20.9621C9.99067 20.3655 8.32167 19.1485 6.993 17.3111C5.66433 15.4738 5 13.4035 5 11.1001V5.69215L12 3.07715L19 5.69215V11.1001C19 13.4028 18.3357 15.4728 17.007 17.3101C15.6783 19.1475 14.0093 20.3641 12 20.9621ZM12 19.9011C13.7333 19.3511 15.1667 18.2511 16.3 16.6011C17.4333 14.9511 18 13.1178 18 11.1011V6.37515L12 4.14515L6 6.37515V11.1001C6 13.1168 6.56667 14.9501 7.7 16.6001C8.83333 18.2501 10.2667 19.3511 12 19.9011Z"
                  fill="#48BE75"
                />
              </svg>
            </IconCirclePersonalInfo>
            개인정보 처리방침
          </Button>
          <Button>
            <IconCircleEtc>
              <svg
                xmlns="http://www.w3.org/2000/svg"
                width="24"
                height="24"
                viewBox="0 0 24 24"
                fill="none"
              >
                <path
                  d="M12 8.5C11.6022 8.5 11.2206 8.65804 10.9393 8.93934C10.658 9.22064 10.5 9.60218 10.5 10V10.107C10.5 10.2396 10.4473 10.3668 10.3536 10.4606C10.2598 10.5543 10.1326 10.607 10 10.607C9.86739 10.607 9.74021 10.5543 9.64645 10.4606C9.55268 10.3668 9.5 10.2396 9.5 10.107V10C9.5 9.33696 9.76339 8.70107 10.2322 8.23223C10.7011 7.76339 11.337 7.5 12 7.5H12.116C12.6029 7.50015 13.0781 7.64939 13.4777 7.92764C13.8772 8.20589 14.182 8.59982 14.351 9.05645C14.52 9.51308 14.5452 10.0105 14.4231 10.4819C14.301 10.9532 14.0375 11.3759 13.668 11.693L12.897 12.354C12.7727 12.4608 12.6728 12.5932 12.6043 12.7422C12.5358 12.8911 12.5002 13.0531 12.5 13.217V13.75C12.5 13.8826 12.4473 14.0098 12.3536 14.1036C12.2598 14.1973 12.1326 14.25 12 14.25C11.8674 14.25 11.7402 14.1973 11.6464 14.1036C11.5527 14.0098 11.5 13.8826 11.5 13.75V13.217C11.5 12.593 11.773 12.001 12.246 11.595L13.016 10.935C13.2307 10.751 13.384 10.5057 13.4551 10.232C13.5262 9.95831 13.5117 9.66942 13.4137 9.40419C13.3157 9.13895 13.1387 8.91011 12.9067 8.74846C12.6747 8.58681 12.3988 8.5001 12.116 8.5H12ZM12 16.5C12.1989 16.5 12.3897 16.421 12.5303 16.2803C12.671 16.1397 12.75 15.9489 12.75 15.75C12.75 15.5511 12.671 15.3603 12.5303 15.2197C12.3897 15.079 12.1989 15 12 15C11.8011 15 11.6103 15.079 11.4697 15.2197C11.329 15.3603 11.25 15.5511 11.25 15.75C11.25 15.9489 11.329 16.1397 11.4697 16.2803C11.6103 16.421 11.8011 16.5 12 16.5Z"
                  fill="#E43059"
                />
                <path
                  d="M3.5 12C3.5 9.74566 4.39553 7.58365 5.98959 5.98959C7.58365 4.39553 9.74566 3.5 12 3.5C14.2543 3.5 16.4163 4.39553 18.0104 5.98959C19.6045 7.58365 20.5 9.74566 20.5 12C20.5 14.2543 19.6045 16.4163 18.0104 18.0104C16.4163 19.6045 14.2543 20.5 12 20.5C9.74566 20.5 7.58365 19.6045 5.98959 18.0104C4.39553 16.4163 3.5 14.2543 3.5 12ZM12 4.5C10.0109 4.5 8.10322 5.29018 6.6967 6.6967C5.29018 8.10322 4.5 10.0109 4.5 12C4.5 13.9891 5.29018 15.8968 6.6967 17.3033C8.10322 18.7098 10.0109 19.5 12 19.5C13.9891 19.5 15.8968 18.7098 17.3033 17.3033C18.7098 15.8968 19.5 13.9891 19.5 12C19.5 10.0109 18.7098 8.10322 17.3033 6.6967C15.8968 5.29018 13.9891 4.5 12 4.5Z"
                  fill="#E43059"
                />
              </svg>
            </IconCircleEtc>
            문의
          </Button>
          <Button>
            <IconCircleInfo>
              <svg
                xmlns="http://www.w3.org/2000/svg"
                width="24"
                height="24"
                viewBox="0 0 24 24"
                fill="none"
              >
                <path
                  d="M11.5 3C14.0196 3 16.4359 4.00089 18.2175 5.78249C19.9991 7.56408 21 9.98044 21 12.5C21 15.0196 19.9991 17.4359 18.2175 19.2175C16.4359 20.9991 14.0196 22 11.5 22C8.98044 22 6.56408 20.9991 4.78249 19.2175C3.00089 17.4359 2 15.0196 2 12.5C2 9.98044 3.00089 7.56408 4.78249 5.78249C6.56408 4.00089 8.98044 3 11.5 3ZM11.5 4C9.24566 4 7.08365 4.89553 5.48959 6.48959C3.89553 8.08365 3 10.2457 3 12.5C3 14.7543 3.89553 16.9163 5.48959 18.5104C7.08365 20.1045 9.24566 21 11.5 21C12.6162 21 13.7215 20.7801 14.7528 20.353C15.7841 19.9258 16.7211 19.2997 17.5104 18.5104C18.2997 17.7211 18.9258 16.7841 19.353 15.7528C19.7801 14.7215 20 13.6162 20 12.5C20 10.2457 19.1045 8.08365 17.5104 6.48959C15.9163 4.89553 13.7543 4 11.5 4ZM11 8V10H12V8H11ZM11 12V17H12V12H11Z"
                  fill="#4C5664"
                />
              </svg>
            </IconCircleInfo>
            정보
          </Button>
        </ButtonWrap>
        <Logout>로그아웃</Logout>
      </ProfileWrap>
      <NavigationBar>
        <NavItem>
          <svg
            xmlns="http://www.w3.org/2000/svg"
            width="24"
            height="24"
            viewBox="0 0 24 24"
            fill="none"
          >
            <path
              d="M6 19H9.692V13.923C9.692 13.6943 9.76967 13.5027 9.925 13.348C10.0797 13.1927 10.2713 13.115 10.5 13.115H13.5C13.7287 13.115 13.9207 13.1927 14.076 13.348C14.2307 13.5027 14.308 13.6943 14.308 13.923V19H18V10.308C18 10.2053 17.9777 10.112 17.933 10.028C17.8883 9.94399 17.8273 9.87066 17.75 9.80799L12.366 5.74999C12.2633 5.66066 12.1413 5.61599 12 5.61599C11.8587 5.61599 11.737 5.66066 11.635 5.74999L6.25 9.80799C6.17333 9.87199 6.11233 9.94532 6.067 10.028C6.02167 10.1107 5.99933 10.204 6 10.308V19ZM5 19V10.308C5 10.052 5.05733 9.80966 5.172 9.58099C5.28667 9.35232 5.44467 9.16399 5.646 9.01599L11.031 4.93799C11.313 4.72266 11.635 4.61499 11.997 4.61499C12.359 4.61499 12.683 4.72266 12.969 4.93799L18.354 9.01499C18.556 9.16299 18.714 9.35166 18.828 9.58099C18.9427 9.80966 19 10.052 19 10.308V19C19 19.268 18.9003 19.5017 18.701 19.701C18.5017 19.9003 18.268 20 18 20H14.116C13.8867 20 13.6947 19.9227 13.54 19.768C13.3853 19.6127 13.308 19.4207 13.308 19.192V14.116H10.692V19.192C10.692 19.4213 10.6147 19.6133 10.46 19.768C10.3053 19.9227 10.1137 20 9.885 20H6C5.732 20 5.49833 19.9003 5.299 19.701C5.09967 19.5017 5 19.268 5 19Z"
              fill="#A8A8A8"
            />
          </svg>
          <span>홈</span>
        </NavItem>
        <NavItem>
          <svg
            xmlns="http://www.w3.org/2000/svg"
            width="25"
            height="24"
            viewBox="0 0 25 24"
            fill="none"
          >
            <path
              d="M11.75 16.5H12.75V12.5H16.75V11.5H12.75V7.5H11.75V11.5H7.75V12.5H11.75V16.5ZM12.253 21C11.0083 21 9.83833 20.764 8.743 20.292C7.64767 19.8193 6.69467 19.178 5.884 18.368C5.07333 17.558 4.43167 16.606 3.959 15.512C3.48633 14.418 3.25 13.2483 3.25 12.003C3.25 10.7577 3.48633 9.58767 3.959 8.493C4.431 7.39767 5.07133 6.44467 5.88 5.634C6.68867 4.82333 7.641 4.18167 8.737 3.709C9.833 3.23633 11.003 3 12.247 3C13.491 3 14.661 3.23633 15.757 3.709C16.8523 4.181 17.8053 4.82167 18.616 5.631C19.4267 6.44033 20.0683 7.39267 20.541 8.488C21.0137 9.58333 21.25 10.753 21.25 11.997C21.25 13.241 21.014 14.411 20.542 15.507C20.07 16.603 19.4287 17.556 18.618 18.366C17.8073 19.176 16.8553 19.8177 15.762 20.291C14.6687 20.7643 13.499 21.0007 12.253 21ZM12.25 20C14.4833 20 16.375 19.225 17.925 17.675C19.475 16.125 20.25 14.2333 20.25 12C20.25 9.76667 19.475 7.875 17.925 6.325C16.375 4.775 14.4833 4 12.25 4C10.0167 4 8.125 4.775 6.575 6.325C5.025 7.875 4.25 9.76667 4.25 12C4.25 14.2333 5.025 16.125 6.575 17.675C8.125 19.225 10.0167 20 12.25 20Z"
              fill="#A8A8A8"
            />
          </svg>
          <span>추가</span>
        </NavItem>
        <NavItem>
          <svg
            xmlns="http://www.w3.org/2000/svg"
            width="24"
            height="24"
            viewBox="0 0 24 24"
            fill="none"
          >
            <path
              d="M5.616 21C5.15533 21 4.771 20.846 4.463 20.538C4.155 20.23 4.00067 19.8457 4 19.385V6.61505C4 6.15505 4.15433 5.77105 4.463 5.46305C4.77167 5.15505 5.156 5.00072 5.616 5.00005H7.385V3.30805C7.385 3.15272 7.436 3.02405 7.538 2.92205C7.64 2.82005 7.76833 2.76905 7.923 2.76905C8.07767 2.76905 8.20633 2.82005 8.309 2.92205C8.41167 3.02405 8.46267 3.15272 8.462 3.30805V5.00005H15.616V3.27005C15.616 3.12738 15.6637 3.00805 15.759 2.91205C15.8543 2.81605 15.9733 2.76838 16.116 2.76905C16.2587 2.76972 16.3773 2.81738 16.472 2.91205C16.5667 3.00672 16.6147 3.12572 16.616 3.26905V5.00005H18.385C18.845 5.00005 19.2293 5.15438 19.538 5.46305C19.8467 5.77172 20.0007 6.15605 20 6.61605V19.385C20 19.845 19.846 20.2294 19.538 20.538C19.23 20.8467 18.8453 21.0007 18.384 21H5.616ZM5.616 20H18.385C18.5383 20 18.6793 19.9361 18.808 19.8081C18.9367 19.6801 19.0007 19.5387 19 19.3841V10.616H5V19.385C5 19.5384 5.064 19.6794 5.192 19.8081C5.32 19.9367 5.461 20.0007 5.615 20"
              fill="#A8A8A8"
            />
          </svg>
          <span>히스토리</span>
        </NavItem>
        <NavItemFocus>
          <svg
            xmlns="http://www.w3.org/2000/svg"
            width="27"
            height="26"
            viewBox="0 0 26 26"
            fill="none"
          >
            <path
              d="M13.5833 12.3339C12.6892 12.3339 11.924 12.0154 11.2877 11.3784C10.6515 10.7414 10.3333 9.97657 10.3333 9.08391C10.3333 8.19124 10.6515 7.42569 11.2877 6.78724C11.924 6.1488 12.6892 5.83138 13.5833 5.83499C14.4774 5.8386 15.2426 6.15638 15.8789 6.78832C16.5152 7.42027 16.8333 8.18582 16.8333 9.08499C16.8333 9.98416 16.5152 10.749 15.8789 11.3795C15.2426 12.01 14.4774 12.3274 13.5833 12.3339ZM6 20.1675V18.3843C6 17.9264 6.13253 17.5054 6.39758 17.1212C6.66264 16.7369 7.01075 16.4372 7.44192 16.222C8.41403 15.7641 9.41431 15.4044 10.4427 15.143C11.4712 14.8815 12.5195 14.7512 13.5877 14.7519C14.6558 14.7526 15.7027 14.883 16.7282 15.143C17.7538 15.4044 18.7526 15.7641 19.7247 16.222C20.1559 16.4372 20.504 16.7369 20.7691 17.1212C21.0341 17.5054 21.1667 17.9261 21.1667 18.3832V20.1664L6 20.1675ZM7.08333 19.0842H20.0833V18.3843C20.0833 18.1164 20.0003 17.8806 19.8342 17.6769C19.6666 17.4725 19.4579 17.3042 19.208 17.1721C18.3291 16.7308 17.418 16.3975 16.4747 16.1722C15.5322 15.9475 14.5684 15.8352 13.5833 15.8352C12.5982 15.8352 11.6341 15.9475 10.6908 16.1722C9.74761 16.3968 8.83689 16.7301 7.95867 17.1721C7.70878 17.3042 7.50042 17.4725 7.33358 17.6769C7.16675 17.8806 7.08333 18.1164 7.08333 18.3843V19.0842ZM13.5833 11.2517C14.1792 11.2517 14.6894 11.0393 15.1141 10.6147C15.5387 10.19 15.7507 9.67938 15.75 9.08282C15.7493 8.48627 15.5373 7.97638 15.1141 7.55316C14.6909 7.12994 14.1806 6.9176 13.5833 6.91616C12.9861 6.91471 12.4762 7.12705 12.0537 7.55316C11.6312 7.97927 11.4188 8.48916 11.4167 9.08282C11.4145 9.67649 11.6268 10.1867 12.0537 10.6136C12.4805 11.0404 12.9904 11.2524 13.5833 11.2495"
              fill="#579AFF"
            />
          </svg>
          <span>프로필</span>
        </NavItemFocus>
      </NavigationBar>
    </Container>
  );
}

export default Profile;
